{
    "the-birth-of-ganesha": {
        "english": {
            "title": "The Birth of Ganesha",
            "story": "Long, long ago, the mighty Goddess Parvati was preparing for a bath on Mount Kailash. She wanted someone to guard her door so that no one could disturb her peace. Since Lord Shiva, her husband, was away, Parvati decided to create a son all by herself!She took the dust and essence from her own body, mixed it with her divine power, and molded it into the shape of a beautiful, strong boy. She breathed life into him, and he immediately stood up.Parvati smiled and told the boy, “Go, my son, and guard this door. Do not let anyone—absolutely anyone—enter.” The loyal boy bowed and took his position, holding a mighty staff.Soon, Lord Shiva returned home. He started to walk toward the house, but the boy stopped him immediately! “Wait! My mother, Goddess Parvati, is inside, and I cannot allow you to enter,” the boy declared bravely. Lord Shiva was surprised by this courageous, strange boy who dared to stop him. The boy was simply following his mother's command, showing true devotion and duty.",
            "summary": "Goddess Parvati wished for a guard while she bathed, so she created a strong and loyal boy, giving him life from her own essence. She instructed him to let no one pass. Soon after, Lord Shiva returned home and was bravely stopped by the boy, who was dedicated to his mother's command.",
            "moral": "It is important to be loyal and dedicated to the duties and responsibilities you are given."
        },
        "hindi": {
            "title": "गणेश का जन्म",
            "story": "बहुत, बहुत पहले की बात है, शक्तिशाली देवी पार्वती कैलाश पर्वत पर स्नान की तैयारी कर रही थीं। वह चाहती थीं कि कोई उनके दरवाज़े की रखवाली करे ताकि कोई उनकी शांति भंग न कर सके। क्योकी उनके पति, भगवान शिव, दूर थे, पार्वती ने स्वयं ही एक पुत्र बनाने का फैसला किया!उन्होंने अपने शरीर की धूल और सार लिया, उसे अपनी दिव्य शक्ति के साथ मिलाया, और उसे एक सुंदर, मजबूत लड़के के आकार में ढाला। उन्होंने उसमें प्राण फूँके, और वह तुरंत खड़ा हो गया।पार्वती मुस्कुराईं और लड़के से बोलीं, “जाओ, मेरे बेटे, और इस दरवाज़े की रखवाली करो। किसी को भी—बिल्कुल किसी को भी—अंदर मत आने देना।” वफ़ादार लड़के ने प्रणाम किया और एक शक्तिशाली छड़ी लेकर अपना स्थान ले लिया।जल्द ही, भगवान शिव घर लौटे। उन्होंने घर की ओर चलना शुरू किया, लेकिन लड़के ने उन्हें तुरंत रोक दिया! लड़के ने बहादुरी से घोषणा की, “ठहरो! मेरी माता, देवी पार्वती, अंदर हैं, और मैं आपको अंदर जाने की अनुमति नहीं दे सकता।” भगवान शिव इस साहसी, अजीब लड़के से आश्चर्यचकित थे जिसने उन्हें रोकने की हिम्मत की। लड़का बस अपनी माँ की आज्ञा का पालन कर रहा था, सच्ची भक्ति और कर्तव्य दिखा रहा था।",
            "summary": "देवी पार्वती स्नान करते समय एक रक्षक चाहती थीं, इसलिए उन्होंने अपनी शक्ति से एक मजबूत और वफ़ादार लड़का बनाया। उन्होंने उसे निर्देश दिया कि वह किसी को भी अंदर न आने दे। कुछ ही देर बाद, भगवान शिव घर लौटे और उस लड़के ने उन्हें बहादुरी से रोक दिया, जो अपनी माँ की आज्ञा के प्रति समर्पित था।",
            "moral": "आपको दिए गए कर्तव्यों और जिम्मेदारियों के प्रति वफादार और समर्पित रहना महत्वपूर्ण है।"
        }
    },
    "holi-ka-dahan": {
        "english": {
            "title": "Holika Dahan: The Triumph of Devotion",
            "story": "In ancient times, there lived a powerful demon king, Hiranyakashipu, who demanded that everyone worship him as a god. His own son, Prahlada, however, was a staunch devotee of Lord Vishnu and refused to bow to his father's tyranny. This infuriated Hiranyakashipu, who subjected Prahlada to numerous cruel punishments, all of which the boy miraculously survived due to his unwavering faith. Desperate to kill his son, Hiranyakashipu turned to his sister, Holika, who possessed a magical boon that made her immune to fire. Holika devised a plan: she would sit in a blazing pyre, holding Prahlada on her lap, believing the fire would consume the boy while she remained unharmed. However, the boon was only effective if she entered the fire alone. As the flames erupted, Prahlada continued chanting Vishnu’s name. By divine grace, Holika's shawl, which shielded her from the fire, flew off and covered Prahlada instead. Holika was burned to ashes, while Prahlada emerged unscathed. Holika Dahan, celebrated the night before the festival of Holi, marks this symbolic victory of good over evil, and the ultimate protection granted by true devotion.",
            "summary": "The demon king Hiranyakashipu tried to kill his devout son, Prahlada, by having his fire-immune sister, Holika, sit with him in a pyre. Due to Prahlada's devotion to Lord Vishnu, Holika's immunity failed, and she was burnt to death, while Prahlada was saved. Holika Dahan commemorates the burning of Holika, signifying the triumph of devotion and virtue over evil intentions.",
            "moral": "True faith in the divine is the greatest protection, and good always prevails over evil, no matter how powerful the adversary."
        },
        "hindi": {
            "title": "होली का दहन: भक्ति की जीत",
            "story": "प्राचीन काल में, एक शक्तिशाली राक्षस राजा हिरण्यकशिपु रहता था, जो चाहता था कि सभी लोग उसे भगवान के रूप में पूजें। हालांकि, उसका अपना पुत्र प्रह्लाद भगवान विष्णु का कट्टर भक्त था और अपने पिता के अत्याचार के सामने झुकने से इनकार कर दिया। इससे हिरण्यकशिपु क्रोधित हो गया, जिसने प्रह्लाद को कई क्रूर दंड दिए, जिनमें से सभी को लड़का अपनी अटूट आस्था के कारण चमत्कारिक रूप से बच गया। अपने पुत्र को मारने के लिए बेताब, हिरण्यकशिपु ने अपनी बहन होलिका की ओर रुख किया, जिसके पास एक जादुई वरदान था जो उसे आग से अछूता बनाता था। होलिका ने एक योजना बनाई: वह एक जलती हुई चिता में प्रह्लाद को गोद में लेकर बैठ जाएगी, यह मानते हुए कि आग लड़के को जला देगी जबकि वह स्वयं सुरक्षित रहेगी। हालांकि, यह वरदान केवल तभी प्रभावी था जब वह अकेले आग में प्रवेश करती। जैसे ही आग भड़क उठी, प्रह्लाद विष्णु का नाम जपता रहा। दिव्य कृपा से, होलिका की शॉल, जो उसे आग से बचा रही थी, उड़ गई और प्रह्लाद को ढक लिया। होलिका राख हो गई, जबकि प्रह्लाद बिना किसी चोट के बाहर आया। होली का दहन, जो होली के त्योहार से एक रात पहले मनाया जाता है, इस प्रतीकात्मक जीत का प्रतीक है कि भक्ति और सद्गुण की शक्ति बुराई पर हमेशा विजय प्राप्त करती है।",
            "summary": "राक्षस राजा हिरण्यकशिपु ने अपने भक्त पुत्र प्रह्लाद को मारने के लिए अपनी आग से अछूती बहन होलिका को उसके साथ चिता में बैठाया। भगवान विष्णु के प्रति प्रह्लाद की भक्ति के कारण, होलिका की सुरक्षा विफल हो गई, और वह जलकर मर गई, जबकि प्रह्लाद बच गया। होली का दहन होलिका के दहन को याद करता है, जो भक्ति और सद्गुण की बुराई पर विजय का प्रतीक है।",
            "moral": "दिव्य में सच्चा विश्वास सबसे बड़ी सुरक्षा है, और चाहे विरोधी कितना भी शक्तिशाली हो, भलाई हमेशा बुराई पर विजय प्राप्त करती है।"
        }
    },
    "krishna-butter-story": {
        "english": {
            "title": "Krishna and the Pot of Butter",
            "story": "As a mischievous and playful child in Gokul, young Krishna had an insatiable love for butter. He would often sneak into the houses of the gopis with his friends, known as the maakhan chor. The gopis, initially annoyed by the constant theft, tried various methods to keep their precious butter safe, often hanging the pots high up on ropes attached to the ceiling. However, Krishna was always one step ahead. Using his ingenuity, he would gather his friends to form human pyramids, or use wooden stools and even his little flute to knock down the clay pots, sharing the stolen treat with his friends and the monkeys. Despite their complaints to his mother, Yashodha, the gopis couldn't stay angry for long, captivated by the charm and innocence of the blue-skinned child. Yashoda, while often attempting to discipline him, would eventually melt at his innocent pleas. This playful story highlights Krishna's loving naughtiness and the bond he shared with the people of Vrindavan, signifying the sweet relationship between a devotee and the divine.",
            "summary": "Young Krishna was notorious in Gokul as the makhan chor. He would cleverly use human pyramids and tools to steal butter pots hung high by the gopis. Despite the complaints, the gopis and his mother, Yashoda, were ultimately charmed by his innocent mischief, illustrating the loving and playful nature of the divine.",
            "moral": "The love between the devotee and the divine is often sweet and playful, and devotion can transform even mischievous acts into acts of love."
        },
        "hindi": {
            "title": "कृष्ण और मक्खन का बर्तन",
            "story": "गोकुल में एक शरारती और खेल-कूद करने वाले बच्चे के रूप में, छोटे कृष्ण को मक्खन के लिए एक अतृप्त प्रेम था। वह अक्सर अपने दोस्तों के साथ गोपियों के घरों में चोरी-छिपे घुस जाता था, जिन्हें मक्खन चोर के नाम से जाना जाता था। गोपी, जो शुरू में लगातार चोरी से परेशान थीं, अपने कीमती मक्खन को सुरक्षित रखने के लिए विभिन्न तरीकों का प्रयास करती थीं, अक्सर बर्तनों को छत से जुड़े रस्सियों पर ऊंचा लटकाती थीं। हालांकि, कृष्ण हमेशा एक कदम आगे था। अपनी बुद्धिमत्ता का उपयोग करते हुए, वह अपने दोस्तों को मानव पिरामिड बनाने के लिए इकट्ठा करता था, या मिट्टी के बर्तनों को गिराने के लिए लकड़ी के स्टूल और यहां तक कि अपनी छोटी बांसुरी का उपयोग करता था, चोरी किए गए व्यंजन को अपने दोस्तों और बंदरों के साथ साझा करता था। उनकी शिकायतों के बावजूद उनकी माँ यशोदा से, गोपी लंबे समय तक गुस्सा नहीं रह सकीं, नीले रंग के बच्चे की आकर्षण और मासूमियत से मोहित हो गईं। यशोदा, जो अक्सर उसे अनुशासित करने की कोशिश करती थीं, अंततः उसकी मासूम विनती पर पिघल जाती थीं। यह खेल-कूद की कहानी कृष्ण की प्रेमपूर्ण शरारत और वृंदावन के लोगों के साथ उसके साझा बंधन को उजागर करती है, जो भक्त और दिव्य के बीच मीठे संबंध का प्रतीक है।",
            "summary": "छोटे कृष्ण गोकुल में मक्खन चोर के रूप में कुख्यात थे। वह चालाकी से मानव पिरामिड और उपकरणों का उपयोग करके मक्खन के बर्तनों को चुराते थे जो गोपी द्वारा ऊंचा लटकाए गए थे। शिकायतों के बावजूद, गोपी और उनकी माँ यशोदा अंततः उसकी मासूम शरारत से मोहित हो गए, जो दिव्य की प्रेमपूर्ण और खेल-कूद करने वाली प्रकृति को दर्शाता है।",
            "moral": "भक्त और दिव्य के बीच का प्रेम अक्सर मीठा और खेल-कूद भरा होता है, और भक्ति शरारती कार्यों को भी प्रेम के कार्यों में बदल सकती है।"
        }
    }
}